Hello everyone here is a file that contains categorical variables. Using your preferred notebook, open the file and convert the State and the Membership columns to the appropriate categorical encoding. In the notebook, introduce what you are doing before writing the code so that we will have an understanding of what you are doing. An example is, from our last assignment, a cell says "Import the necessary libraries" then the next cell imported pandas.

Column definition: State column indicates the hotel's customer comes from. Membership column indicates the membership type the hotel's customer registered for. MOV (Membership Ordinal Values) column indicates the ordinal values. This should be gotten from the membership column and it should be values from A to Z. Remember one of the categorical encoding type measures the priority of a categorical value in letters. MCT (Membership Categorical Transform) column indicates the observation for the transformed membership type. This should be gotten from the transforming the MOV column

Feel free to ask more questions if needed.

Difficulty level of this task is medium so we expect to hand it in tomorrow

# Importing the datasets

### Load the necessary libraries

In [1]:
import pandas as pd

#### Load The Datasets

In [2]:
Cat = pd.read_excel('Categorical_encoding.xlsx')

#### Cleaning Web Dataset

#### Sample the web dataset

In [3]:
Cat.head(10)

     State Membership  MOV  MCT
0  Anambra       Gold  NaN  NaN
1    Enugu     Silver  NaN  NaN
2    Lagos   Platinum  NaN  NaN
3    Abuja     Silver  NaN  NaN
4  Bayelsa   Platinum  NaN  NaN
5      Imo    Diamond  NaN  NaN

#### Get Basic Information About The Dataset

In [4]:
Cat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   State       6 non-null      object
 1   Membership  6 non-null      object
 2   MOV         0 non-null      float64
 3   MCT         0 non-null      float64
dtypes: float64(2), object(2)
memory usage: 320.0+ bytes

##### I need to change the observations in the MOV (Membership Ordinal Values) column indicates the ordinal values. This should be gotten from the membership column and it should be values from A to Z

In [23]:
def new_MOV(Cat):
    if Cat ["Membership"] =="Diamond":
        result = "A"
    elif Cat ["Membership"] =="Gold":
        result = "B"
    elif Cat ["Membership"] =="Silver":
        result = "C"
    elif Cat ["Membership"] =="Platinum":
        result = "D"
    return result

##### Complete the code below to Create a new column called MOVV that will hold new column observations in the dataframe. Notice the difference in column names: MOV vs MOVV

In [24]:
Cat["MOVV"] = Cat.apply(new_MOV, axis="columns")
Cat

     State Membership  MOV MCT MCT MOVV
0  Anambra       Gold  NaN NaN   2    B
1    Enugu     Silver  NaN NaN   3    C
2    Lagos   Platinum  NaN NaN   4    D
3    Abuja     Silver  NaN NaN   3    C
4  Bayelsa   Platinum  NaN NaN   4    D
5      Imo    Diamond  NaN NaN   1    A

In [25]:
def new_MCT(Cat):
    if Cat ["Membership"] =="Diamond":
        result = "1"
    elif Cat ["Membership"] =="Gold":
        result = "2"
    elif Cat ["Membership"] =="Silver":
        result = "3"
    elif Cat ["Membership"] =="Platinum":
        result = "4"
    return result

In [26]:
Cat["MCTT"] = Cat.apply(new_MCT, axis="columns")
Cat

     State Membership  MOV MCT MCT MOVV MCTT
0  Anambra       Gold  NaN NaN   2    B    2
1    Enugu     Silver  NaN NaN   3    C    3
2    Lagos   Platinum  NaN NaN   4    D    4
3    Abuja     Silver  NaN NaN   3    C    3
4  Bayelsa   Platinum  NaN NaN   4    D    4
5      Imo    Diamond  NaN NaN   1    A    1

In [27]:
Cat=Cat[["State","Membership", "MOVV","MCTT"]]
Cat

     State Membership MOVV MCTT
0  Anambra       Gold    B    2
1    Enugu     Silver    C    3
2    Lagos   Platinum    D    4
3    Abuja     Silver    C    3
4  Bayelsa   Platinum    D    4
5      Imo    Diamond    A    1

In [28]:
Cat=Cat.rename(columns = {"MOVV":"MOV","MCTT":"MCT"})
Cat

     State Membership MOV MCT
0  Anambra       Gold   B   2
1    Enugu     Silver   C   3
2    Lagos   Platinum   D   4
3    Abuja     Silver   C   3
4  Bayelsa   Platinum   D   4
5      Imo    Diamond   A   1

###### THANK YOU!!